tap 'koekeishiya/formulae'

brew 'git'
brew 'nvim'
brew 'gh'
brew 'yabai'
brew 'fswatch'
brew 'jq'
brew 'bat'
brew 'btop'
brew 'lazygit'
brew 'lazydocker'
brew 'yazi'
brew 'sleepwatcher', postinstall:"cp sleepwatcher/wakeup ~/.wakeup", start_service: true
brew 'colima', start_service: true
brew 'docker'

cask_args no_quarantine: true
cask 'ghostty'
cask 'microsoft-word'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'arc'
cask 'obsidian'
cask 'displaperture'
